//-----------------------  ------------------------
// Стрелочные функции:

// 1) Не имеют this.
// 2) Не имеют arguments.
// 3) Не могут быть вызваны с new.
// 4) (У них также нет super, но мы про это не говорили. Про это будет
//     в главе Наследование классов).
// Всё это потому, что они предназначены для небольшого кода, который 
//     не имеет своего «контекста», выполняясь в текущем. И они отлично
//     справляются с этой задачей!

//-------------------  --------------------


//-----------------  -----------------


//------------------------  --------------------------


//--------------------------  -----------------------------


//--------------------------  --------------------------
