//-----------------------  ------------------------
// 1) JSON – это формат данных, который имеет собственный независимый
//     стандарт и библиотеки для большинства языков программирования.
// 2) JSON поддерживает простые объекты, массивы, строки, числа, 
//     логические значения и null.
// 3) JavaScript предоставляет методы JSON.stringify для сериализации
//     в JSON и JSON.parse для чтения из JSON.
// 4) Оба метода поддерживают функции преобразования для 
//     интеллектуального чтения/записи.
// 5) Если объект имеет метод toJSON, то он вызывается через JSON.stringify.

//-------------------  --------------------


//-----------------  -----------------


//------------------------  --------------------------


//--------------------------  -----------------------------


//--------------------------  --------------------------
