// Так называемый «условный» оператор «вопросительный знак» позволяет нам
// сделать это более коротким и простым способом.

// Оператор представлен знаком вопроса ?. Его также называют «тернарный»,
// так как этот оператор, единственный в своём роде, имеет три аргумента.

// Синтаксис:

// let result = условие ? значение1 : значение2;

// Сначала вычисляется условие: если оно истинно, тогда возвращается 
// значение1, в противном случае – значение2.

// Например:

// let accessAllowed = (age > 18) ? true : false;

// Последовательность операторов вопросительного знака ? позволяет вернуть
// значение, которое зависит от более чем одного условия.

// Например:

// let age = prompt('Возраст?', 18);

// let message = (age < 3) ? 'Здравствуй, малыш!' :
//   (age < 18) ? 'Привет!' :
//   (age < 100) ? 'Здравствуйте!' :
//   'Какой необычный возраст!';

// alert( message );