//-----------------------  ------------------------
// В этой главе мы кратко описали способ задания [[Prototype]] 
//     для объектов, создаваемых с помощью функции-конструктора. 
//     Позже мы рассмотрим, как можно использовать эту возможность.

// Всё достаточно просто. Выделим основные моменты:

// 1) Свойство F.prototype (не путать с [[Prototype]]) устанавливает
//     [[Prototype]] для новых объектов при вызове new F().
// 2) Значение F.prototype должно быть либо объектом, либо null.
//     Другие значения не будут работать.
// 3) Свойство "prototype" является особым, только когда оно назначено 
//     функции-конструктору, которая вызывается оператором new.
// 4) В обычных объектах prototype не является чем-то особенным:

// let user = {
//   name: "John",
//   prototype: "Bla-bla" // никакой магии нет - обычное свойство
// };
// По умолчанию все функции имеют F.prototype = { constructor: F }, 
//     поэтому мы можем получить конструктор объекта через 
//     свойство "constructor".

//-------------------  --------------------


//-----------------  -----------------


//------------------------  --------------------------


//--------------------------  -----------------------------


//--------------------------  --------------------------
