// Пример использования switch 

// let a = 2 + 2;

// switch (a) {
//   case 3:
//     alert( 'Маловато' );
//     break;
//   case 4:
//     alert( 'В точку!' );
//     break;
//   case 5:
//     alert( 'Перебор' );
//     break;
//   default:
//     alert( "Нет таких значений" );
// }
//Если break нет, то выполнение пойдёт ниже по следующим case, при этом
    //остальные проверки игнорируются.
//И switch и case допускают любое выражение в качестве аргумента.
//Например:

// let a = "1";
// let b = 0;

// switch (+a) {
//   case b + 1:
//     alert("Выполнится, т.к. значением +a будет 1");
//     break;

//   default:
//     alert("Это не выполнится");
// }
// В этом примере выражение +a вычисляется в 1, что совпадает с 
    //выражением b + 1 в case, и следовательно, код в этом блоке будет 
    //выполнен.
//Hесколько вариантов case, использующих один код, можно группировать.
    //Для примера, выполним один и тот же код для case 3 и case 5, 
    //сгруппировав их:

// let a = 3;

// switch (a) {
//   case 4:
//     alert('Правильно!');
//     break;

//   case 3: // (*) группируем оба case
//   case 5:
//     alert('Неправильно!');
//     alert("Может вам посетить урок математики?");
//     break;

//   default:
//     alert('Результат выглядит странновато. Честно.');
// }
//Теперь оба варианта 3 и 5 выводят одно сообщение.
//Нужно отметить, что проверка на равенство всегда строгая. Значения должны быть одного типа, чтобы выполнялось равенство.