// 1)Есть объект salaries с произвольным количеством свойств, содержащих
//     заработные платы

// Напишите функцию sumSalaries(salaries), которая возвращает сумму всех
//     зарплат с помощью метода Object.values и цикла for..of.

// Если объект salaries пуст, то результат должен быть 0.

// Ответ: 
// function sumSalaries(salaries) {
//     let sum = 0;
//     for (let value of Object.values(salaries)) {
//         sum += value;
//     }
//     return sum;
// }

// let salaries = {
    
// };
  
// console.log( sumSalaries(salaries) );

//------------------------------------------- 2 -------------------------------------------
// Напишите функцию count(obj), которая возвращает количество
//     свойств объекта:

// Ответ: 
// let user = {
//   name: 'John',
//   age: 30
// };

// console.log( count(user) ); // 2

// function count(obj) {
//     return Object.keys(obj).length;
// }

//------------------------------------------- 3 -------------------------------------------


// Ответ:


//------------------------------------------- 4 -------------------------------------------


// Ответ:


//------------------------------------------- 5 -------------------------------------------


// Ответ: 


//------------------------------------------- 6 -------------------------------------------


// Ответ:


//------------------------------------------- 7 -------------------------------------------


// Ответ: 


//------------------------------------------- 8 -------------------------------------------


// Ответ:


//------------------------------------------- 9 -------------------------------------------


// Ответ: 


//------------------------------------------- 10 -------------------------------------------


// Ответ:


//------------------------------------------- 11 -------------------------------------------


// Ответ: 


//------------------------------------------- 12 -------------------------------------------


// Ответ:


//------------------------------------------- 13 -------------------------------------------


// Ответ:
