// 1)Напишите код, выполнив задание из каждого пункта отдельной строкой:

// 1. Создайте пустой объект user.
// 2. Добавьте свойство name со значением John.
// 3. Добавьте свойство surname со значением Smith.
// 4. Измените значение свойства name на Pete.
// 5. Удалите свойство name из объекта.

// Ответ: 
// 1.
// let user = {};
// 2.
// user.name = 'John';
// 3.
// user.surname = 'Smith';
// 4.
// user.name = 'Pete';
// 5.
// delete user.name;

//-------------------------------- 2 -----------------------------------
// Напишите функцию isEmpty(obj), которая возвращает true, если у 
//    объекта нет свойств, иначе false.

// Ответ: 
// function isEmpty(obj) {
//     for (let key in obj) {
//       // если тело цикла начнет выполняться - значит в объекте есть
//       return false;
//     }
//     return true;
// }
   
//-------------------------------- 3 -----------------------------------
// Можно ли изменить объект, объявленный с помощью const?
// const user = {
//     name: "John"
//   };
  
//   // это будет работать?
//   user.name = "Pete";
// Ответ: Да. user хранит ссылку на объект. И это не может быть изменено
//      Но содержимое объекта менять можно.

//-------------------------------- 4 -----------------------------------
// У нас есть объект, в котором хранятся зарплаты нашей команды:

// let salaries = {
//     John: 100,
//     Ann: 160,
//     Pete: 130
// };
// Напишите код для суммирования всех зарплат и сохраните результат в
//      переменной sum. Должно получиться 390.
// Eсли объект salaries пуст, то результат должен быть 0.

// Ответ:
// function SumOfSalaries(obj) {
//     let sum = 0;
//     for (let prop in obj) {
//         sum += obj[prop];
//     }
//     console.log(sum);
// }

// SumOfSalaries(salaries);

//-------------------------------- 5 -----------------------------------
// Создайте функцию multiplyNumeric(obj), которая умножает все числовые
//      свойства объекта obj на 2.

// Ответ:
// let menu = {
//     width: 200,
//     height: 300,
//     title: "My menu"
//   };

// function multiplyNumeric(obj) {
//     for (let prop in obj) {
//         if (typeof(obj[prop]) == 'number') {
//             obj[prop] *= 2;
//         }
//     }
// }