// 1) Измените код makeCounter() так, чтобы счётчик мог увеличивать
//      и устанавливать значение:

// 1) counter() должен возвращать следующее значение (как и раньше).
// 2) counter.set(value) должен устанавливать счётчику значение value.
// 3) counter.decrease() должен уменьшать значение счётчика на 1.
// Посмотрите код из песочницы с полным примером использования.

// P.S. Для того, чтобы сохранить текущее значение счётчика, можно 
//     воспользоваться как замыканием, так и свойством функции. 
//     Или сделать два варианта решения: и так, и так.

// function makeCounter() {

//     function counter() {
//       return counter.count++;
//     };
  
//     counter.count = 0;
  
//     return counter;
//   }
  
//   let counter = makeCounter();
  
//   counter.count = 10;
//   alert( counter() ); // 10

// Ответ: 
// В решении использована локальная переменная count, а методы сложения
//     записаны прямо в counter. Они разделяют одно и то же лексическое
//     окружение и также имеют доступ к текущей переменной count.

// function makeCounter() {
//   let count = 0;

//   function counter() {
//     return count++;
//   }

//   counter.set = value => count = value;

//   counter.decrease = () => count--;

//   return counter;
// }

//------------------------------------------- 2 -------------------------------------------


// Ответ: 


//------------------------------------------- 3 -------------------------------------------


// Ответ:


//------------------------------------------- 4 -------------------------------------------


// Ответ:


//------------------------------------------- 5 -------------------------------------------


// Ответ: 


//------------------------------------------- 6 -------------------------------------------


// Ответ:


//------------------------------------------- 7 -------------------------------------------


// Ответ: 


//------------------------------------------- 8 -------------------------------------------


// Ответ:


//------------------------------------------- 9 -------------------------------------------


// Ответ: 


//------------------------------------------- 10 -------------------------------------------


// Ответ:


//------------------------------------------- 11 -------------------------------------------


// Ответ: 


//------------------------------------------- 12 -------------------------------------------


// Ответ:


//------------------------------------------- 13 -------------------------------------------


// Ответ:
