// 1) Выведется ли alert?

// if ("0") {
//   alert( 'Привет' );
// }

// Да 
// ---------------------------------------------------------------------
// 2) Используя конструкцию if..else, напишите код, который будет  
//     спрашивать:"Какое «официальное» название JavaScript?". Если 
//     пользователь вводит «ECMAScript», то показать: «Верно!», в 
//     противном случае – отобразить: «Не знаете? ECMAScript!»

// let answer = prompt("Какое «официальное» название JavaScript?");

// if (answer == "ECMAScript") {
//     alert("Верно!");
// } else {
//     alert("Не знаете? ECMAScript!");
// }
//----------------------------------------------------------------------
// 3) Используя конструкцию if..else, напишите код, который получает 
    //число через prompt, а затем выводит в alert:

//1, если значение больше нуля,
//-1, если значение меньше нуля,
//0, если значение равно нулю.

// let value = prompt("Какое «официальное» название JavaScript?");

// if (value > 0) {
//     alert("1");
// } else if(value == 0) {
//     alert("0");
// } else {
//     alert("-1");
// }
//----------------------------------------------------------------------
//4) Перепишите конструкцию if с использованием условного оператора '?':

// let result;

// if (a + b < 4) {
//   result = 'Мало';
// } else {
//   result = 'Много';
// }

// result = (a + b < 4) ? "Мало" : "Много";
//----------------------------------------------------------------------
//5) Перепишите if..else с использованием нескольких операторов '?'.
//let message;

// if (login == 'Сотрудник') {
//   message = 'Привет';
// } else if (login == 'Директор') {
//   message = 'Здравствуйте';
// } else if (login == '') {
//   message = 'Нет логина';
// } else {
//   message = '';
// }

// message = (login == 'Сотрудник') ? 'Привет' :
//  (login == 'Директор') ? 'Здравствуйте':
//  (login == '') ? 'Нет логина' : 
//  '';
