// 1) Преобразуйте user в JSON, затем прочитайте 
//   этот JSON в другую переменную.

// Ответ:
// let user = {
//   name: "Василий Иванович",
//   age: 35
// };

// let user2 = JSON.parse(JSON.stringify(user));

//------------------------------------------- 2 -------------------------------------------
// В простых случаях циклических ссылок мы можем исключить свойство,
//   из-за которого они возникают, из сериализации по его имени.
// Но иногда мы не можем использовать имя, так как могут быть и другие,
//   нужные, свойства с этим именем во вложенных объектах. Поэтому 
//   можно проверять свойство по значению.
// Напишите функцию replacer для JSON-преобразования, которая удалит
//   свойства, ссылающиеся на meetup:

// Ответ: 
// let room = {
//   number: 23
// };

// let meetup = {
//   title: "Совещание",
//   occupiedBy: [{name: "Иванов"}, {name: "Петров"}],
//   place: room
// };

// room.occupiedBy = meetup;
// meetup.self = meetup;

// alert( JSON.stringify(meetup, function replacer(key, value) {
//   return (key != "" && value == meetup) ? undefined : value;
// }));

/*
{
  "title":"Совещание",
  "occupiedBy":[{"name":"Иванов"},{"name":"Петров"}],
  "place":{"number":23}
}
*/
// Здесь нам также нужно проверить key =="", чтобы исключить первый
//   вызов, где значение value равно meetup.

//------------------------------------------- 3 -------------------------------------------


// Ответ:


//------------------------------------------- 4 -------------------------------------------


// Ответ:


//------------------------------------------- 5 -------------------------------------------


// Ответ: 


//------------------------------------------- 6 -------------------------------------------


// Ответ:


//------------------------------------------- 7 -------------------------------------------


// Ответ: 


//------------------------------------------- 8 -------------------------------------------


// Ответ:


//------------------------------------------- 9 -------------------------------------------


// Ответ: 


//------------------------------------------- 10 -------------------------------------------


// Ответ:


//------------------------------------------- 11 -------------------------------------------


// Ответ: 


//------------------------------------------- 12 -------------------------------------------


// Ответ:


//------------------------------------------- 13 -------------------------------------------


// Ответ:
