// 1)  Какое последнее значение выведет этот код?
// let i = 3;

// while (i) {
//   alert( i-- );
// } 
//Ответ: 1.
//------------------------------------ 2 ----------------------------
//Для каждого цикла запишите, какие значения он выведет.
    //Оба цикла выводят alert с одинаковыми значениями или нет?
    //1. Префиксный вариант ++i:

// let i = 0;
// while (++i < 5) alert( i );

    //2. Постфиксный вариант i++:

// let i = 0;
// while (i++ < 5) alert( i );

//Ответ: 1. (1, 2, 3, 4)
//       2. (1, 2, 3, 4, 5)
//-------------------------------- 3 ---------------------------------
// //Для каждого цикла запишите, какие значения он выведет.
    //Оба цикла выводят alert с одинаковыми значениями или нет?
    //1. Префиксный вариант ++i:

//for (let i = 0; i < 5; i++) alert( i );
   
    //2. Постфиксный вариант i++:

//for (let i = 0; i < 5; ++i) alert( i );

//Ответ: 1. (0, 1, 2, 3, 4)
//       2. (0, 1, 2, 3, 4)
//Такой результат обусловлен алгоритмом работы for:
// 1. Выполнить единожды присваивание i = 0 перед чем-либо (начало).
// 2. Проверить условие i < 5
// 3. Если true – выполнить тело цикла alert(i), и затем i++
//-------------------------------- 4 ---------------------------------
//При помощи цикла for выведите чётные числа от 2 до 10.

//Ответ:
// for(let i = 2; i <= 10; i++) {
//     if (i % 2 == 1) continue;
//     console.log(i)   
// }

// for(let i = 1; i <= 5; i++) console.log(i * 2);
//------------------------------- 5 ----------------------------------
//Перепишите код, заменив цикл for на while, без изменения поведения 
    //цикла:
// for (let i = 0; i < 3; i++) {
//   alert( `number ${i}!` );
// }

//Ответ:
// let i = 0;
// while (i < 3) {
//     console.log( `number ${i}!` );
//     i++;
// }
//-------------------------------- 6 -----------------------------------
//Напишите цикл, который предлагает prompt ввести число, большее 100. 
    //Если посетитель ввёл другое число – попросить ввести ещё раз, и 
    //так далее. Цикл должен спрашивать число пока либо посетитель не 
    //введёт число, большее 100, либо не нажмёт кнопку Отмена (ESC).

//Ответ:
// let num;

// do {
//   num = prompt("Введите число больше 100?", 0);
// } while (num <= 100 && num);
//------------------------------ 7 -------------------------------------
//Напишите код, который выводит все простые числа из интервала от 2 до n

//Ответ:
let n = prompt("w");

nextPrime:
for (let i = 2; i <= n; i++) { 

  for (let j = 2; j < i; j++) { 
    if (i % j == 0) continue nextPrime; 
  }

  alert(i); 
}