// 1)  Обязателен ли "else"?
// Следующая функция возвращает true, если параметр age больше 18. В
//     ином случае она запрашивает подтверждение через confirm и 
//     возвращает его результат:
// let age = 14;
// function checkAge(age) {
//     if (age > 18) {
//       return true;
//     } else {
//       // ...
//       return confirm('Родители разрешили?');
//     }
//   }
// Будет ли эта функция работать как-то иначе, если убрать else?

//   function checkAge(age) {
//     if (age > 18) {
//       return true;
//     }
//     // ...
//     return confirm('Родители разрешили?');
//   }

//Ответ: Оба варианта функций работают одинаково, отличий нет.
//------------------------------------ 2 ----------------------------
// Перепишите функцию, используя оператор '?' или '||'

// function checkAge(age) {
//     if (age > 18) {
//       return true;
//     } else {
//       return confirm('Родители разрешили?');
//     }
// }

// Ответ: 
// function checkAge(age) {
//     return (age > 18) ? true : confirm('Родители разрешили?');
// }

// function checkAge(age) {
//     return (age > 18) || confirm('Родители разрешили?');
// }
//-------------------------------- 3 -----------------------------------
// Напишите функцию min(a,b), которая возвращает меньшее из чисел a и b.

// Ответ: 
// function min(a, b) {
//     if (a < b) {
//         return a;
//     } else {
//         return b;
//     }
// }
//-------------------------------- 4 -----------------------------------
// Напишите функцию pow(x,n), которая возвращает x в степени n. Иначе 
//     говоря, умножает x на себя n раз и возвращает результат. В этой
//     задаче функция обязана поддерживать только натуральные значения n
//     т.е. целые от 1 и выше.

let x = prompt("x? "),
    n = prompt("n? ");

function pow(x, n){
    let res = x;
    for (let i = 1; i < n; i++) {
        res *= x;
    }
    return res;
}

if (n < 1) {
    alert(`Степень ${n} не поддерживается, используйте натуральное число`);
  } else {
    alert( pow(x, n) );
  }