// 1)Напишите деструктурирующее присваивание, которое:

//     - свойство name присвоит в переменную name.
//     - свойство years присвоит в переменную age.
//     - свойство isAdmin присвоит в переменную isAdmin (false, если нет
//     такого свойства)

// Oтвет: 
// let user = { name: "John", years: 30 };

// let {name, years: age, isAdmin = false} = user;

// alert( name ); // John
// alert( age ); // 30
// alert( isAdmin ); // false

//------------------------------------------- 2 -------------------------------------------
// Создайте функцию topSalary(salaries), которая возвращает имя самого
//     высокооплачиваемого сотрудника.

// Если объект salaries пустой, то нужно вернуть null.
// Если несколько высокооплачиваемых сотрудников, можно вернуть любого
//     из них.
// P.S. Используйте Object.entries и деструктурирование, чтобы перебрать
//     пары ключ/значение.

// Ответ: 
let salaries = {
    "John": 500,
    "Pete": 300,
    "Mary": 450
};

function topSalary (salaries) {
    let top,
        max = null;

    for (let [key, value] of Object.entries(salaries)) {
        if (value > max) {
            max = value;
            top = key;
        }
    }
    return top;
}

console.log(topSalary(salaries));
//------------------------------------------- 3 -------------------------------------------


// Ответ:


//------------------------------------------- 4 -------------------------------------------


// Ответ:


//------------------------------------------- 5 -------------------------------------------


// Ответ: 


//------------------------------------------- 6 -------------------------------------------


// Ответ:


//------------------------------------------- 7 -------------------------------------------


// Ответ: 


//------------------------------------------- 8 -------------------------------------------


// Ответ:


//------------------------------------------- 9 -------------------------------------------


// Ответ: 


//------------------------------------------- 10 -------------------------------------------


// Ответ:


//------------------------------------------- 11 -------------------------------------------


// Ответ: 


//------------------------------------------- 12 -------------------------------------------


// Ответ:


//------------------------------------------- 13 -------------------------------------------


// Ответ:
