// 1) Что выведет код ниже?

// alert( null || 2 || undefined );

// Решение: 2
//---------------------------------------------------------------------
// 2) Что выведет код ниже?

//alert( alert(1) || 2 || alert(3) );

//Ответ: сначала 1, затем 2. Вызов alert не возвращает значения, или, 
    //иначе говоря, возвращает undefined. 
//--------------------------------------------------------------------
// 3) Что выведет код ниже?

// alert( 1 && null && 2 );

// Ответ: null, потому что это первое «ложное» значение из списка.
//----------------------------------------------------------------------
// 4) Что выведет код ниже?

// alert( alert(1) && alert(2) );

// Ответ: 1, а затем undefined.
//----------------------------------------------------------------------
// 5) Что выведет код ниже?

// alert( null || 2 && 3 || 4 );

// Ответ: 3.
//----------------------------------------------------------------------
// 6) Напишите условие if для проверки, что переменная age находится 
    //в диапазоне между 14 и 90 включительно.

// Ответ: if(age >= 14 && age <= 90)
//----------------------------------------------------------------------
// 7) Напишите условие if для проверки, что значение переменной age НЕ 
    //находится в диапазоне 14 и 90 включительно. Напишите два варианта:
    //первый с использованием оператора НЕ !, второй – без этого 
    //оператора

// Ответ:
    //1. if(!(age >= 14 && age <= 90))
    //2. if(age < 14 || age > 90)
//----------------------------------------------------------------------
// 8) Какие из перечисленных ниже alert выполнятся? Какие конкретно 
    //значения будут результатами выражений в условиях if(...)?
    
    // 1. if (-1 || 0) alert( 'first' );
    // 2. if (-1 && 0) alert( 'second' );
    // 3. if (null || -1 && 1) alert( 'third' );

// Ответ: 1 - true
    //    2 - false
    //    3 - 1(true)
//----------------------------------------------------------------------
// 9) Напишите код, который будет спрашивать логин с помощью prompt.
    //Если посетитель вводит «Админ», то prompt запрашивает пароль, если
    //ничего не введено или нажата клавиша Esc – показать «Отменено», в
    //противном случае отобразить «Я вас не знаю».

//Пароль проверять так:

//Если введён пароль «Я главный», то выводить «Здравствуйте!»,
//Иначе – «Неверный пароль»,
//При отмене – «Отменено».

// Ответ:
// let login,
//     password;

// login = prompt("Enter login");

// if (login == "Админ") {
//     password = prompt("Enter password");
//     if (password == "Я главный") {
//         alert("Здравствуйте!");
//     } else if (password == "" || password == null) {
//         alert("Отменено");
//     } else {
//         alert("Неверный пароль");
//     }
// } else if (login == "" || login == null) {
//     alert("Отменено");
// } else {
//     alert("Я вас не знаю");
// }
